README.md
```mermaid
graph LR
  subgraph Artemis
    direction LR
    Queue1(Queue1) --> Queue2(Queue2)
    Queue2(Queue2) --> Topic1(Topic1)
    Topic1(Topic1) --> Topic2(Topic2)
  end
```
